import { PrismaClient } from '@prisma/client'

const prisma = new PrismaClient()
async function main() {
  await prisma.member.createMany({
    data: [
      {
        alias: "ถึงอายุเจ๊จะมากมาย แต่เจ๊รับรองได้ว่าเจ๊ถึงใจแน่นอน",
        realName: "คมกฤต บินล่าเต๊ะ",
        studentId: "66200033",
        sect: "สำนักอาหวังสาขารองจากต้นหลิว ให้มาสักกี่ต้นงิ้วเจ๊ก็ไม่ถอย",
        imageUrl: "/card1.png",
        prediction: "เเหม่เลือกใบนี้สะด้วย เจ๊บอกละถึงใจแน่ คำทำนายคือหนุ่มสาวใดเลือกใบนี้ ความโชคดีเกิดเห็นผล คนใดโสดไร้คนชื่นชม เจ๊ขอบอกตรงๆว่าคืนนี้ได้พบหวานใจ",
      },
      {
        alias: "ห่มสบงเลยทรงพลัง แต่ถ้าหนูไม่มีตังเดี๋ยวอาตมาให้เอง",
        realName: "ภควัต พิชัยณรงค์",
        studentId: "66200193",
        sect: "สำนักกุฏิเด้งดึ๋ง มีแต่สาวอวบอึ๋มมมาจองคิวทำนาย",
        imageUrl: "/card2.png",
        prediction: "หญิงชายใดได้ใบนี้ หน้าตาดีกันทุกราย แลกไอจีหรือขอไลน์ สมเป้าหมายทุกการเล็ง ได้แล้วอย่าลืมแบ่งอาตมา!",
      },
      {
        alias: "นางฟ้าคนนี้ยังมีแฟน แล้วคนดูมีคนควงแขนอะยัง",
        realName: "ชฎาภรณื โพธิ์ศิริ",
        studentId: "66200336",
        sect: "สำนักสววรค์เขตท่าแซะ ชั้นเจ็ด แล้วว่าเด็กท่าแซะเด็ดๆเพนิ",
        imageUrl: "/card3.png",
        prediction: "การ์ดนี้ทำนายว่า ทางด้านปัญหาจะหมดไป การเงินโดดเด่นกว่าอื่นใด ถ้าสมใจพี่ขอยืมสักร้อยที",
      },
      {
        alias: "อิคคิวซังที่ว่าแน่ ต้องพ่ายแพ้แม่หมอปอฝ้าย",
        realName: "วาสิตา ใจรังษี",
        studentId: "66200395",
        sect: "สำนักฮ๋ายะน้ะ ใช้นิ้ววนขมับจนแสบ เธอบอกแปลกๆอย่าเปลี่ยนหมอคนใหม่",
        imageUrl: "/card4.png",
        prediction: "ท่านผู้ใดใด้ใบนี้ บอกอีกทีมีลาภใหญ่ อาจารย์อ๊อดตอบอย่างไว ใครได้ใบนี้ไปผมให้เอ",
      },
      {
        alias: "บังกอล์ฟละมาขายโรตี เศรษฐกิจไม่ดีเลยย้ายมาทำนายดวง",
        realName: "สรกฤต มีอินทร์",
        studentId: "66200407",
        sect: "สำนักอาทวง ลืมไรลืมได้ อย่าลืมจ่ายค่าโรตีบังก็พอ",
        imageUrl: "/card5.png",
        prediction: "คำทำนายบอกไว้ชัด ใครมีรักอาจช้ำชอก มีแต่การลวงหลอก จงระวังไว้ให้ดี ถ้าเศร้าอย่าลืมกัน ร้านอาบังอยู่ทางนี้ เหล้าขมมันไม่ดี มากินโรตีบังนี่มา",
      },
    ],
  });

  console.log("Seed data inserted ✅");
}

main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });